In [2]:
# 쥬피터노트북 셀 스타일 조절 
from IPython.core.display import display, HTML
display(HTML("<style>.container { font-weight: bold !important; }</style>"))
display(HTML("<style>.container { width: 100% !important; }</style>"))

# 경고 메세지 숨기기 
import warnings
warnings.filterwarnings(action='ignore')

In [4]:
# 관련 모듈 임포트 
import numpy as np
import pandas as pd

### 데이타프레임 컬럼의 집게함수
- 데이타프레임[컬럼명].집계함수()
- 데이타프레임.loc[행명].집계함수()
- 데이타프레임.집계함수(axis=0/1)
- mean() / max() / min() / sum() / std() / median()

In [5]:
# 샘플 데이타프레임 생성 
data = {'kor':[40, 55, 66],
         'math':[70, 55, 66],
         'eng':[80, 95, 100]}
index=['user1','user2','user3']
df = pd.DataFrame(data, index=index)
df

       kor  math  eng
user1   40    70   80
user2   55    55   95
user3   66    66  100

In [8]:
# 국어 kor 컬럼의 총합과 평균
df['kor'].sum(), df.loc[:, 'kor'].sum(), df.iloc[:,0].sum()

(161, 161, 161)

In [9]:
# 국어 kor 컬럼의 총합과 평균
df['kor'].mean(), round(df.loc[:, 'kor'].mean(),2), round(df.iloc[:, 0].mean(),3)

(53.666666666666664, 53.67, 53.667)

In [14]:
# kor, math 컬럼의 평균
print(df[['kor', 'math']])
print()
print(df[['kor','math']].mean())

       kor  math
user1   40    70
user2   55    55
user3   66    66

kor     53.666667
math    63.666667
dtype: float64

In [19]:
# user1의 행의 평균과 합게
print(df.loc['user1'])
print()
df.loc['user1'].mean(),round(df.iloc[0].mean(),2), df.loc['user1'].sum()

kor     40
math    70
eng     80
Name: user1, dtype: int64

(63.333333333333336, 63.33, 190)

In [15]:
df

       kor  math  eng
user1   40    70   80
user2   55    55   95
user3   66    66  100

In [21]:
# 모든 행의 평균
df.loc['user1':'user3'].mean(), df.iloc[:].mean()

(kor     53.666667
 math    63.666667
 eng     91.666667
 dtype: float64,
 kor     53.666667
 math    63.666667
 eng     91.666667
 dtype: float64)

In [22]:
# 모든 컬럼의 평균
df.loc[:].mean()

kor     53.666667
math    63.666667
eng     91.666667
dtype: float64

In [23]:
df.iloc[:].mean()
# df.iloc[0:3].mean()

kor     53.666667
math    63.666667
eng     91.666667
dtype: float64

In [24]:
# df.mean(axis=0)
df.mean()

kor     53.666667
math    63.666667
eng     91.666667
dtype: float64

In [27]:
# 각 행의 평균
df.mean(axis=1)

user1    63.333333
user2    68.333333
user3    77.333333
dtype: float64

In [28]:
# 평균 컬럼 추가
df['mean'] = df.mean(axis=1)
df

       kor  math  eng       mean
user1   40    70   80  63.333333
user2   55    55   95  68.333333
user3   66    66  100  77.333333

In [29]:
df.mean(axis=0)

kor     53.666667
math    63.666667
eng     91.666667
mean    69.666667
dtype: float64

In [30]:
# 행으로 추가
df.loc['mean'] = df.mean(axis=0)
df

             kor       math         eng       mean
user1  40.000000  70.000000   80.000000  63.333333
user2  55.000000  55.000000   95.000000  68.333333
user3  66.000000  66.000000  100.000000  77.333333
mean   53.666667  63.666667   91.666667  69.666667

### Dataframe 정보 알아보기
- 데이타프레임.dtypes : 데이타형 확인
- 데이타프레임.shape : 데이타프레임 형태
- 데이타프레임.info() : 데이타형 확인
- 데이타프레임이름.describe() : 총합, 평균, 표준편차,최소값을 자동으로 출력

In [31]:
# 샘플 데이타프레임 생성 
data = {'kor':[40, 55, 66],
         'math':[70, 55, 66],
         'eng':[80, 95, 100]}
index=['user1','user2','user3']
df = pd.DataFrame(data, index=index)
df

       kor  math  eng
user1   40    70   80
user2   55    55   95
user3   66    66  100

In [33]:
df.shape, df.size, len(df), df.ndim

((3, 3), 9, 3, 2)

In [34]:
# 모든 컬럼의 데이타형
df.dtypes

kor     int64
math    int64
eng     int64
dtype: object

In [37]:
# 특정 컬럼의 데이타형
df['kor'].dtype, df['kor'].dtypes

(dtype('int64'), dtype('int64'))

In [38]:
# 전체 데이타프레임 정보
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, user1 to user3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   kor     3 non-null      int64
 1   math    3 non-null      int64
 2   eng     3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [39]:
# 전체 데이타프레임 정보 => 데이타프레임
df.describe()

             kor       math         eng
count   3.000000   3.000000    3.000000
mean   53.666667  63.666667   91.666667
std    13.051181   7.767453   10.408330
min    40.000000  55.000000   80.000000
25%    47.500000  60.500000   87.500000
50%    55.000000  66.000000   95.000000
75%    60.500000  68.000000   97.500000
max    66.000000  70.000000  100.000000

In [42]:
# kor, math 최소값,25%~75%, 최대값 슬라이싱
df.describe().loc['min':'max','kor':'math']

      kor  math
min  40.0  55.0
25%  47.5  60.5
50%  55.0  66.0
75%  60.5  68.0
max  66.0  70.0

### Dataframe Boolean Index
- 데이타프레임 인덱스시 사용됨
- 마스크(Mask)라고도 함
- 결과값이 True/False 형태의 Boolean으로 표시
- 비교 연산자 == , >= , <= , >, <, !=
- 다중 조건시 논리 연산자 사용 : &, |, ~
- df.loc [ 조건식 ]
- df.loc [ 조건식, 컬럼명 ]
- df.loc [ 조건식, [ 컬럼명1, 컬럼명2 ..] ]
- df.loc [ 조건식 ][ 컬럼명 ]

In [74]:
# 샘플 데이타 
data = { "year":[2014, 2015, 2016, 2015, 2017,2013]
        ,"name":['Haidi', 'Haidi', 'Haidi', 'Charles', 'Charles',  'Hayoung']
        , "points":[1.5, 1.7, 3.6, 2.5, 2.9, 4.0]
        , "penalty":[0.1,0.2, 0.3,0.4,0.5,0.1 ]
        , "net_points":[1.4,1.5,3.3,2.1,2.4,2.1]
        , "bonus":[10,20,30,40,50,60]}
df = pd.DataFrame(data, 
                  columns=["year","name","points","penalty","net_points","bonus"],
                 index=["one", "two", "three", "four", "five","six"])
df

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [44]:
print(df.shape)
df.dtypes

(6, 6)

year            int64
name           object
points        float64
penalty       float64
net_points    float64
bonus           int64
dtype: object

In [46]:
# name 값이 Charles 데이타 추출
df['name'] == 'Charles'

one      False
two      False
three    False
four      True
five      True
six      False
Name: name, dtype: bool

In [47]:
# 실제 데이타는?
# 데이타프레임[조건식]
df[df['name'] == 'Charles']

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
five  2017  Charles     2.9      0.5         2.4     50

In [47]:
# 실제 데이타는?
# 데이타프레임[조건식]
df[df['name'] == 'Charles']

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
five  2017  Charles     2.9      0.5         2.4     50

In [48]:
# 데이타프레임[조건식]
# 특정 컬럼 추출
df[df['name'] == 'Charles'][['year', 'name','bonus']]

      year     name  bonus
four  2015  Charles     40
five  2017  Charles     50

In [51]:
# 데이타프레임.loc[조건식, 컬럼리스트]
df.loc[df['name'] == 'Charles',['year', 'name','bonus']]

      year     name  bonus
four  2015  Charles     40
five  2017  Charles     50

In [54]:
# point 컬럼값이 2.5이상
df[df['points'] >= 2.5]

       year     name  points  penalty  net_points  bonus
three  2016    Haidi     3.6      0.3         3.3     30
four   2015  Charles     2.5      0.4         2.1     40
five   2017  Charles     2.9      0.5         2.4     50
six    2013  Hayoung     4.0      0.1         2.1     60

In [55]:
# point 컬럼값이 2.5이상 이고 net_points 컬럼값이 2.2이하
df[(df['points'] >= 2.5) & (df['net_points'] <= 2.2)]

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
six   2013  Hayoung     4.0      0.1         2.1     60

In [56]:
# points 컬럼값이 2.5 이상 이고 net_points 컬럼값이 2.2 이하
# name, points, penalty 컬럼만 출력 
df[(df['points'] >= 2.5) & (df['net_points'] <= 2.2)][['name', 'points', 'penalty']]

         name  points  penalty
four  Charles     2.5      0.4
six   Hayoung     4.0      0.1

In [57]:
df.loc[(df['points'] >= 2.5) & (df['net_points'] <= 2.2), 'name':'penalty']

         name  points  penalty
four  Charles     2.5      0.4
six   Hayoung     4.0      0.1

In [59]:
# ~(not), !=
# name 값이 Haidi가 아니다.
~(df['name'] == 'Haidi')

one      False
two      False
three    False
four      True
five      True
six       True
Name: name, dtype: bool

In [60]:
df[~(df['name'] == 'Haidi')]

      year     name  points  penalty  net_points  bonus
four  2015  Charles     2.5      0.4         2.1     40
five  2017  Charles     2.9      0.5         2.4     50
six   2013  Hayoung     4.0      0.1         2.1     60

In [61]:
# 조건식을 이용한 컬럼값 변경
# points 컬럼값이 2.5 이상이면 bonus 컬럼값을 100으로 변경하여라
df['points']>=2.5

one      False
two      False
three     True
four      True
five      True
six       True
Name: points, dtype: bool

In [68]:
df.loc[df['points']>=2.5,'bonus']=100
df

       year     name  points  penalty  net_points  bonus
one    2014    Haidi     1.5      0.1         1.4     10
two    2015    Haidi     1.7      0.2         1.5     20
three  2016    Haidi     3.6      0.3         3.3    100
four   2015  Charles     2.5      0.4         2.1    100
five   2017  Charles     2.9      0.5         2.4    100
six    2013  Hayoung     4.0      0.1         2.1    100

In [69]:
# 조건식을 이용한 새로운 컬럼 추가
# pass 컬럼을 추가 => points 컬럼값이 2.5이상이면 '0'삽입
df['points'] >= 2.5

one      False
two      False
three     True
four      True
five      True
six       True
Name: points, dtype: bool

In [77]:
df.loc[df['points'] >= 2.5,'pass']='O'
df.loc[df['points'] < 2.5,'pass']='X'

In [78]:
df

       year     name  points  penalty  net_points  bonus pass
one    2014    Haidi     1.5      0.1         1.4     10    X
two    2015    Haidi     1.7      0.2         1.5     20    X
three  2016    Haidi     3.6      0.3         3.3     30    O
four   2015  Charles     2.5      0.4         2.1     40    O
five   2017  Charles     2.9      0.5         2.4     50    O
six    2013  Hayoung     4.0      0.1         2.1     60    O

### 퀴즈
1) eng 과목에서 eng 평균점수보다 높은 학생은?

- 평균점수 구하기
- 조건식
- 불린인덱싱 적용

In [89]:
data = {'kor':{'고길동':40, '김희동':55, '신윤지':66, '이민호':77, '박준희':34},
         'math':{'고길동':70, '김희동':55, '신윤지':66, '이민호':20, '박준희':40},
         'eng':{'고길동':80, '김희동':95, '신윤지':100, '이민호':77, '박준희':90}}
data

{'kor': {'고길동': 40, '김희동': 55, '신윤지': 66, '이민호': 77, '박준희': 34},
 'math': {'고길동': 70, '김희동': 55, '신윤지': 66, '이민호': 20, '박준희': 40},
 'eng': {'고길동': 80, '김희동': 95, '신윤지': 100, '이민호': 77, '박준희': 90}}

# 샘플 데이타프레임 생성 
data = {'kor':[40, 55, 66, 77, 34],
         'math':[70, 55, 66, 20, 40],
         'eng':[80, 95, 100, 77, 90]}
index=['고길동', '김희동', '신윤지', '이민호', '박준희']
df = pd.DataFrame(data, index=index)
df

In [90]:
df = pd.DataFrame(data)
df

     kor  math  eng
고길동   40    70   80
김희동   55    55   95
신윤지   66    66  100
이민호   77    20   77
박준희   34    40   90

In [95]:
# 1) eng 과목에서 eng 평균점수보다 높은 학생은?
df.loc[df['eng']>df['eng'].mean()].index

Index(['김희동', '신윤지', '박준희'], dtype='object')

In [96]:
# 파이썬의 리스트로 변경 
list(df[df['eng'] >= df['eng'].mean()].index)

['김희동', '신윤지', '박준희']

In [97]:
# 리스트 => 문자열 
' , '.join(['김희동', '신윤지', '박준희'])

'김희동 , 신윤지 , 박준희'

In [98]:
df['tot']=df.loc[df['kor':'eng'].sum()]
df['avg']=df['eng'].mean()
df

KeyError: 'kor'